app/controllers/instructor/courses_controller.rb

INSERT INTO "courses" ("title", "description", "cost", "user_id", "created_at", "updated_at", "image") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "test"], ["description", "test"], ["cost", "12.0"], ["user_id", 1], ["created_at", "2019-10-17 21:49:50.278379"], ["updated_at", "2019-10-17 21:49:50.278379"], ["image", "img.jpeg"]]
---
  def create
    @course = current_user.courses.create(course_params)

SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def current_course
    @current_course ||= Course.find(params[:id])