app/models/section.rb

SELECT "sections".* FROM "sections" WHERE "sections"."course_id" = $1 AND (row_order < 1073741824) ORDER BY "sections"."row_order" DESC LIMIT $2  [["course_id", 2], ["LIMIT", 1]]
---
  def previous_section
    section = course.sections.where("row_order < ?", self.row_order).rank(:row_order).last